Repository: Nandanaa/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/development_strategy.po
Languages: ta_in

source: Development Strategy
ta_in: வளர்ச்சி வசதி

source: Versioning
ta_in: பதிப்பு

source: The Qiskit project is made up of several elements each performing different functionality. Each is independently useful and can be used on their own, but for convenience we provide this repository and meta-package to provide a single entrypoint to install all the elements at once. This is to simplify the install process and provide a unified interface to end users. However, because each Qiskit element has it's own releases and versions some care is needed when dealing with versions between the different repositories. This document outlines the guidelines for dealing with versions and releases of both Qiskit elements and the meta-package.
ta_in: Qiskit திட்டம் ஒவ்வொன்றும் வெவ்வேறு செயல்பாடுகளைச் செய்யும் பல கூறுகளால் ஆனது. ஒவ்வொன்றும் சுயாதீனமாக பயனுள்ளதாக இருக்கும், மேலும் அவை அவற்றிலேயே பயன்படுத்தப்படலாம், ஆனால் வசதிக்காக இந்த கூறுகளை ஒரே நேரத்தில் நிறுவ ஒரே நுழைவு புள்ளியை வழங்க இந்த களஞ்சியத்தையும் மெட்டா தொகுப்பையும் வழங்குகிறோம். இது நிறுவல் செயல்முறையை எளிதாக்குவது மற்றும் இறுதி பயனர்களுக்கு ஒரு ஒருங்கிணைந்த இடைமுகத்தை வழங்குவதாகும். இருப்பினும், ஒவ்வொரு Qiskit உறுப்புக்கும் அதன் சொந்த வெளியீடுகள் மற்றும் பதிப்புகள் இருப்பதால், வெவ்வேறு களஞ்சியங்களுக்கு இடையிலான பதிப்புகளைக் கையாளும் போது சில கவனிப்பு தேவைப்படுகிறது. கிஸ்கிட் கூறுகள் மற்றும் மெட்டா-தொகுப்பு இரண்டின் பதிப்புகள் மற்றும் வெளியீடுகளைக் கையாள்வதற்கான வழிகாட்டுதல்களை இந்த ஆவணம் கோடிட்டுக் காட்டுகிறது.

source: For the rest of this guide the standard Semantic Versioning nomenclature will be used of: ``Major.Minor.Patch`` to refer to the different components of a version number. For example, if the version number was ``0.7.1``, then the major version is ``0``, the minor version ``7``, and the patch version ``1``.
ta_in: இந்த வழிகாட்டியின் மீதமுள்ள நிலையான சொற்பொருள் பதிப்பு பெயரிடல் பயன்படுத்தப்படும்: ``Major.Minor.Patch`` பதிப்பு எண்ணின் வெவ்வேறு கூறுகளைக் குறிக்க. எடுத்துக்காட்டாக, பதிப்பு எண் ``0.7.1`` எனில், முக்கிய பதிப்பு ``0``, சிறிய பதிப்பு `` 7``, மற்றும் பேட்ச் பதிப்பு ``1``.

source: Meta-package Version
ta_in: மெட்டா-தொகுப்பு பதிப்பு

source: The Qiskit meta-package version is an independent value that is determined by the releases of each of the elements being tracked. Each time we push a release to a tracked component (or add an element) the meta-package requirements, and version will need to be updated and a new release published. The timing should be coordinated with the release of elements to ensure that the meta-package releases track with element releases.
ta_in: Qiskit மெட்டா-தொகுப்பு பதிப்பு என்பது ஒரு சுயாதீனமான மதிப்பாகும், இது கண்காணிக்கப்படும் ஒவ்வொரு உறுப்புகளின் வெளியீடுகளால் தீர்மானிக்கப்படுகிறது. ஒவ்வொரு முறையும் ஒரு வெளியீட்டை கண்காணிக்கப்பட்ட கூறுக்கு (அல்லது ஒரு உறுப்பைச் சேர்க்க) மெட்டா-தொகுப்பு தேவைகளுக்குத் தள்ளுகிறோம், மேலும் பதிப்பு புதுப்பிக்கப்பட்டு புதிய வெளியீடு வெளியிடப்பட வேண்டும். மெட்டா-தொகுப்பு வெளியீடுகள் உறுப்பு வெளியீடுகளுடன் தடமறிவதை உறுதிசெய்ய உறுப்புகளின் வெளியீட்டில் நேரத்தை ஒருங்கிணைக்க வேண்டும்.

source: Adding New Elements
ta_in: புதிய தனிப்பயன் சேர்

source: When a new Qiskit element is being added to the meta-package requirements, we need to increase the **Minor** version of the meta-package.
ta_in: மெட்டா-தொகுப்பு தேவைகளுக்கு புதிய Qiskit உறுப்பு சேர்க்கப்படும்போது, மெட்டா-தொகுப்பின் **Minor** பதிப்பை அதிகரிக்க வேண்டும்.

source: For example, if the meta-package is tracking 2 elements ``qiskit-aer`` and ``qiskit-terra`` and it's version is ``0.7.4``. Then we release a new element ``qiskit-ignis`` that we intend to also have included in the meta-package. When we add the new element to the meta-package we increase the version to ``0.8.0``.
ta_in: எடுத்துக்காட்டாக, மெட்டா-தொகுப்பு 2 உறுப்புகள் ``qiskit-aer`` மற்றும் ``qiskit-terra`` ஆகியவற்றைக் கண்காணிக்கும் என்றால், அதன் பதிப்பு ``0.7.4``. மெட்டா-தொகுப்பில் சேர்க்கப்பட விரும்பும் புதிய உறுப்பு ``qiskit-ignis`` ஐ வெளியிடுகிறோம். மெட்டா-தொகுப்பில் புதிய உறுப்பைச் சேர்க்கும்போது, பதிப்பை ``0.8.0`` ஆக அதிகரிக்கிறோம்.

source: Patch Version Increases
ta_in: பக்க பதிப்பு அதிகரிப்பு

source: When any Qiskit element that is being already tracked by the meta-package releases a patch version to fix bugs in a release we need also bump the requirement in the setup.py and then increase the patch version of the meta-package.
ta_in: மெட்டா-தொகுப்பால் ஏற்கனவே கண்காணிக்கப்படும் எந்த Qiskit உறுப்பு ஒரு வெளியீட்டில் பிழைகளை சரிசெய்ய ஒரு பேட்ச் பதிப்பை வெளியிடும் போது, நமக்குத் தேவைப்படும் setup.py இல் உள்ள தேவையை பம்ப் செய்து பின்னர் மெட்டா-தொகுப்பின் பேட்ச் பதிப்பை அதிகரிக்கும்.

source: For example, if the meta-package is tracking 3 elements ``qiskit-terra==0.8.1``, ``qiskit-aer==0.2.1``, and ``qiskit-ignis==0.1.4`` with the current version ``0.9.6``. When qiskit-terra release a new patch version to fix a bug ``0.8.2`` the meta-package will also need to increase it's patch version and release, becoming ``0.9.7``.
ta_in: எடுத்துக்காட்டாக, மெட்டா-தொகுப்பு 3 கூறுகளை கண்காணிக்கிறதென்றால் ``qiskit-terra == 0.8.1``, ``qiskit-aer==0.2.1``, மற்றும் ``qiskit-ignis==0.1.4` `தற்போதைய பதிப்பில் ``0.9.6``. ஒரு பிழையை சரிசெய்ய qiskit-terra ஒரு புதிய பேட்ச் பதிப்பை வெளியிடும் போது ``0.8.2`` மெட்டா-தொகுப்பு அதன் பேட்ச் பதிப்பையும் வெளியீட்டையும் அதிகரிக்க வேண்டும், இது ``0.9.7`` ஆகிறது.

source: Additionally, there are occasionally packaging or other bugs in the meta-package itself that need to be fixed by pushing new releases. When those are encountered we should increase the patch version to differentiate it from the broken release. Do **not** delete the broken or any old releases from pypi in any situation, instead just increase the patch version and upload a new release.
ta_in: கூடுதலாக, மெட்டா-தொகுப்பில் எப்போதாவது பேக்கேஜிங் அல்லது பிற பிழைகள் உள்ளன, அவை புதிய வெளியீடுகளைத் தள்ளுவதன் மூலம் சரி செய்யப்பட வேண்டும். அவை எதிர்கொள்ளும்போது, உடைந்த வெளியீட்டிலிருந்து வேறுபடுவதற்கு பேட்ச் பதிப்பை அதிகரிக்க வேண்டும். எந்த சூழ்நிலையிலும் பைபியிலிருந்து உடைந்த அல்லது பழைய வெளியீடுகளை ** செய்ய வேண்டாம் **, அதற்கு பதிலாக பேட்ச் பதிப்பை அதிகரித்து புதிய வெளியீட்டைப் பதிவேற்றவும்.

source: Minor Version Increases
ta_in: சிறிய பதிப்பு அதிகரிப்பு

source: Besides adding a new element to the meta-package the minor version of the meta-package should also be increased anytime a minor version is increased in a tracked element.
ta_in: மெட்டா-தொகுப்பில் ஒரு புதிய உறுப்பைச் சேர்ப்பதைத் தவிர, கண்காணிக்கப்பட்ட உறுப்பில் ஒரு சிறிய பதிப்பு அதிகரிக்கப்படும் எந்த நேரத்திலும் மெட்டா-தொகுப்பின் சிறிய பதிப்பும் அதிகரிக்கப்பட வேண்டும்.

source: For example, if the meta-package is tracking 2 elements ``qiskit-terra==0.7.0`` and ``qiskit-aer==0.1.1`` and the current version is ``0.7.5``. When the ``qiskit-aer`` element releases ``0.2.0`` then we need to increase the meta-package version to be ``0.8.0`` to correspond to the new release.
ta_in: எந்த மொழிபெயர்ப்பும் உங்கள் தேடலுடன் பொருந்தவில்லை எடுத்துக்காட்டாக, மெட்டா-தொகுப்பு 2 கூறுகளை கண்காணிக்கிறதென்றால் `` qiskit-terra == 0.7.0`` மற்றும் `` qiskit-aer == 0.1.1`` மற்றும் தற்போதைய பதிப்பு `` 0.7.5``. `` qiskit-aer`` உறுப்பு `` 0.2.0`` ஐ வெளியிடும் போது, புதிய வெளியீட்டிற்கு ஒத்ததாக மெட்டா-தொகுப்பு பதிப்பை `` 0.8.0`` ஆக அதிகரிக்க வேண்டும்.

source: Major Version Increases
ta_in: முக்கிய பதிப்பு அதிகரிப்பு

source: The major version is different from the other version number components. Unlike the other version number components, which are updated in lock step with each tracked element, the major version is only increased when all tracked versions are bumped (at least before ``1.0.0``). Right now all the elements still have a major version number component of ``0`` and until each tracked element in the meta-repository is marked as stable by bumping the major version to be ``>=1`` then the meta-package version should not increase the major version.
ta_in: முக்கிய பதிப்பு மற்ற பதிப்பு எண் கூறுகளிலிருந்து வேறுபட்டது. கண்காணிக்கப்பட்ட ஒவ்வொரு உறுப்புடனும் பூட்டு படிநிலையில் புதுப்பிக்கப்படும் பிற பதிப்பு எண் கூறுகளைப் போலன்றி, கண்காணிக்கப்பட்ட அனைத்து பதிப்புகளும் மோதும்போது மட்டுமே முக்கிய பதிப்பு அதிகரிக்கும் (குறைந்தது ``1.0.0`` க்கு முன்). இப்போதே எல்லா உறுப்புகளும் ``0`` இன் முக்கிய பதிப்பு எண் கூறுகளைக் கொண்டுள்ளன, மேலும் மெட்டா-களஞ்சியத்தில் கண்காணிக்கப்படும் ஒவ்வொரு உறுப்புகளும் முக்கிய பதிப்பை ``>=1`` என்று மெருகுவதன் மூலம் நிலையானதாகக் குறிக்கப்படும் வரை மெட்டா- தொகுப்பு பதிப்பு முக்கிய பதிப்பை அதிகரிக்கக்கூடாது.

source: The behavior of the major version number component tracking after when all the elements are at >=1.0.0 has not been decided yet.
ta_in: அனைத்து உறுப்புகளும் >=1.0.0 இல் இருக்கும்போது முக்கிய பதிப்பு எண் கூறு கண்காணிப்பின் நடத்தை இன்னும் முடிவு செய்யப்படவில்லை.

source: Qiskit Element Requirement Tracking
ta_in: Qiskit உறுப்பு தேவை கண்காணிப்பு

source: While not strictly related to the meta-package and Qiskit versioning how we track the element versions in the meta-package's requirements list is important. Each element listed in the setup.py should be pinned to a single version. This means that each version of Qiskit should only install a single version for each tracked element. For example, the requirements list at any given point should look something like::
ta_in: மெட்டா-தொகுப்பு மற்றும் கிஸ்கிட் பதிப்போடு கண்டிப்பாக தொடர்புடையதல்ல என்றாலும், மெட்டா-தொகுப்பின் தேவைகள் பட்டியலில் உள்ள உறுப்பு பதிப்புகளை நாங்கள் எவ்வாறு கண்காணிக்கிறோம் என்பது முக்கியம். Setup.py இல் பட்டியலிடப்பட்டுள்ள ஒவ்வொரு உறுப்புகளும் ஒற்றை பதிப்பில் பொருத்தப்பட வேண்டும். இதன் பொருள் Qiskitடின் ஒவ்வொரு பதிப்பும் கண்காணிக்கப்பட்ட ஒவ்வொரு உறுப்புக்கும் ஒரு பதிப்பை மட்டுமே நிறுவ வேண்டும். எடுத்துக்காட்டாக, எந்த நேரத்திலும் தேவைகள் பட்டியல்::

source: This is to aid in debugging, but also make tracking the versions across multiple elements more transparent.
ta_in: இது பிழைதிருத்தத்திற்கு உதவுவதோடு, பல கூறுகள் முழுவதும் பதிப்புகளைக் கண்காணிப்பதை மேலும் வெளிப்படையானதாக மாற்றுவதும் ஆகும்.

source: It is also worth pointing out that the order we install the elements is critically important too. ``pip`` does not have a real dependency solver which means the installation order matters. So if there are overlapping requirements versions between elements or dependencies between elements we need to ensure that the order in the requirements list installs everything as expected. If the order needs to be change for some install time incompatibility it should be noted clearly.
ta_in: நாம் கூறுகளை நிறுவும் வரிசையும் விமர்சன ரீதியாக முக்கியமானது என்பதையும் சுட்டிக்காட்ட வேண்டியது அவசியம். ``pip`` க்கு உண்மையான சார்பு தீர்வி இல்லை, அதாவது நிறுவல் ஒழுங்கு முக்கியமானது. எனவே உறுப்புகளுக்கு இடையில் ஒன்றுடன் ஒன்று தேவைகள் பதிப்புகள் அல்லது உறுப்புகளுக்கு இடையிலான சார்புநிலைகள் இருந்தால், தேவைகள் பட்டியலில் உள்ள வரிசை எதிர்பார்த்தபடி அனைத்தையும் நிறுவுகிறது என்பதை உறுதிப்படுத்த வேண்டும். சில நிறுவல் நேர இணக்கமின்மைக்கு ஆர்டர் மாற்றப்பட வேண்டுமானால் அதை தெளிவாகக் குறிப்பிட வேண்டும்.

source: Community Extensions
ta_in: சமூக நீட்டிப்புகள்

source: Qiskit has been designed with modularity in mind. It is extensible in many different ways; on the page, we highlight the ways in which the Qiskit community has engaged with Qiskit and developed extensions and packages on top of it.
ta_in: Qiskit மட்டுத்தன்மையை மனதில் கொண்டு வடிவமைக்கப்பட்டுள்ளது. இது பல வழிகளில் விரிவாக்கக்கூடியது; பக்கத்தில், Qiskit சமூகம் Qiskit உடன் ஈடுபட்டுள்ள வழிகளையும், அதன் மேல் நீட்டிப்புகள் மற்றும் தொகுப்புகளை உருவாக்கிய வழிகளையும் எடுத்துக்காட்டுகிறோம்.

source: Providers
ta_in: வழங்குநர்கள்

source: The Qiskit base provider is an entity that provides access to a group of different backends (for example, backends available through IBM Quantum). It interacts with those backends to do many things: find out which ones are available, retrieve an instance of a particular backend, get backend properties and configurations, and handling running and working with jobs.
ta_in: Qiskit அடிப்படை வழங்குபவர் ஒரு விகிதமான பின்னணிகளை அணுகுவதை வழங்குகிறது (உதாரணமாக, IBM Quantum மூலம் கிடைக்கும் பின்னணி). இது பல விஷயங்கள் செய்வதற்கு பின்னூட்டத்துடன் செயல்படுகிறது: கண்டுபிடுக்க எந்த விஷயங்கள் கிடைக்கப்பெறும், ஒரு குறிப்பிட்ட பின்னணி ஒரு நிகழ்வுகளை மீட்கவும், பின்னணி பண்புகள் மற்றும் வடிவமைப்புகளை பெறவும், இயங்கும் மற்றும் பணிகளுடன் பணிபுரிந்து கொள்ளும்.

source: Additional providers
ta_in: கூடுதல் வழங்குநர்கள்

source: **Decision diagram-based quantum simulator**
ta_in: **தீர்வு வரைபடம்-அடிப்படையிலான குவாண்டம் பாணி**

source: - **Organization:** Johannes Kepler University, Linz, Austria (Alwin Zulehner and Robert Wille)
ta_in: - **நிறுவனங்கள்:** ஜாஹான்ஸ் கெப்லர் பல்கலைக்கழகம், லின்ஸ், ஆஸ்திரியா (Alwin Zulehner and Robert Wille)

source: - **Description:** A local provider which allows Qiskit to use decision diagram-based quantum simulation
ta_in: - **விளக்கம்:** ஒரு உள்ளூர் வழங்குநர், கிஸ்கிட்டை முடிவு வரைபடம் சார்ந்த குவாண்டம் உருவகப்படுத்துதலைப் பயன்படுத்த அனுமதிக்கிறது

source: - **Qiskit Version:** 0.7
ta_in: - **Qiskit பதிப்பு:** 0. 7

source: - **More info:** `Webpage at JKU <http://iic.jku.at/eda/research/quantum_simulation>`__, `Medium Blog <https://medium.com/qiskit/classical-simulators-for-quantum-computers-4b994dad4fa2>`__ and `GitHub Repo <https://github.com/Qiskit/qiskit-jku-provider>`__
ta_in: - **மேலும் தகவல்:** `Webpage at JKU <http://iic.jku.at/eda/research/quantum_simulation>`__, `Medium Blog <https://medium.com/qiskit/classical-simulators-for-quantum-computers-4b994dad4fa2>`__ and `GitHub Repo <https://github.com/Qiskit/qiskit-jku-provider>`__

source: - **Organization:** QuTech-Delft
ta_in: - **நிறுவனங்கள்:** QuTech-Delft

source: - **Description:** A provider for the Quantum Inspire backend
ta_in: - **விளக்கம்:** Quantum Inspire பின்தளத்தில் ஒரு வழங்குநர்

source: - **More info:** `Medium Blog <https://medium.com/qiskit/quantum-inspire-and-qiskit-f1be608f8955>`__ and `GitHub <https://github.com/QuTech-Delft/quantuminspire>`__.
ta_in: - **மேலும் தகவல்:** `Medium Blog <https://medium.com/qiskit/quantum-inspire-and-qiskit-f1be608f8955>`__ and `GitHub <https://github.com/QuTech-Delft/quantuminspire>`__.

source: Transpiler
ta_in: டிரான்ஸ்பைலர்

source: Circuit optimization is at the heart of making quantum computing feasible on actual hardware. A central component of Qiskit is the transpiler, which is a framework for manipulating quantum circuits according to certain transformations (known as transpiler passes). The transpiler enables users to create customized sets of passes, orchestrated by a pass manager, to transform the circuit according to the rules specified by the passes. In addition, the transpiler architecture is designed for modularity and extensibility, enabling Qiskit users to write their own passes, use them in the pass manager, and combine them with existing passes. In this way, the transpiler architecture opens up the door for research into aggressive optimization of quantum circuits.
ta_in: உண்மையான வன்பொருளில் குவாண்டம் கம்ப்யூட்டிங்கை சாத்தியமாக்கும் மையத்தில் சுற்று உகப்பாக்கம் உள்ளது. கிஸ்கிட்டின் மையக் கூறு டிரான்ஸ்பைலர் ஆகும், இது சில மாற்றங்களின்படி குவாண்டம் சுற்றுகளை கையாளுவதற்கான ஒரு கட்டமைப்பாகும் (டிரான்ஸ்பைலர் பாஸ் என அழைக்கப்படுகிறது). பாஸ் மேலாளரால் திட்டமிடப்பட்ட தனிப்பயனாக்கப்பட்ட பாஸ் தொகுப்புகளை உருவாக்க பயனர்களுக்கு உதவுகிறது, பாஸால் குறிப்பிடப்பட்ட விதிகளின்படி சுற்றுகளை மாற்றும். கூடுதலாக, டிரான்ஸ்பைலர் கட்டமைப்பு மட்டு மற்றும் விரிவாக்கத்திற்காக வடிவமைக்கப்பட்டுள்ளது, Qiskit பயனர்கள் தங்கள் சொந்த பாஸ்களை எழுதவும், அவற்றை பாஸ் மேலாளரில் பயன்படுத்தவும், இருக்கும் பாஸுடன் இணைக்கவும் உதவுகிறது. இந்த வழியில், குவாண்டம் சுற்றுகளின் ஆக்கிரோஷமான தேர்வுமுறை குறித்த ஆராய்ச்சிக்கான கதவை டிரான்ஸ்பைலர் கட்டமைப்பு திறக்கிறது.

source: Additional passes
ta_in: கூடுதல் பாஸ்

source: **t|ket〉 optimization & routing pass**
ta_in: **t|ket> ஒப்பீட்டளவு & வழு வழி**

source: - **Organization:** Cambridge Quantum Computing
ta_in: - **நிறுவனங்கள்:** கேம்ப்ரிட்ஜ் குவாண்டம் கணிப்பு

source: - **Description:** Transpiler pass for circuit optimization and mapping to backend using CQC's t|ket〉compiler.
ta_in: - ** விளக்கம்: ** CQC இன் t | ket கம்பைலரைப் பயன்படுத்தி சுற்று உகப்பாக்கம் மற்றும் பின்தளத்தில் வரைபடத்திற்கான டிரான்ஸ்பைலர் பாஸ்.

source: - **More info:** `Tutorial Notebook <https://github.com/Qiskit/qiskit-tutorials/blob/master/community/aqua/chemistry/QSE_pytket.ipynb>`__ and `GitHub <https://github.com/CQCL/pytket>`__.
ta_in: - **மேலும் தகவல்: ** `Tutorial Notebook <https://github.com/Qiskit/qiskit-tutorials/blob/master/community/aqua/chemistry/QSE_pytket.ipynb>`__ and ` GitHub <https://github.com/CQCL/pytket>`__.

source: Tools
ta_in: கருவிகள்

source: Extending Qiskit with new tools and functionality is an important part of building a community. These tools can be new visualizations, slack integration, Jupyter extensions and much more.
ta_in: புதிய கருவிகள் மற்றும் செயல்பாட்டுடன் Qiskit விரிவாக்குவது ஒரு சமூகத்தை உருவாக்குவதில் ஒரு முக்கிய பகுதியாகும். இந்த கருவிகள் புதிய காட்சிப்படுத்தல், மந்தமான ஒருங்கிணைப்பு, ஜூபிட்டர் நீட்டிப்புகள் மற்றும் பலவாக இருக்கலாம்.

source: Additional Tools
ta_in: கூடுதலான கருவிகளை

source: **OpenControls library**
ta_in: **OpenControls நூலகம்**

source: - **Organization:** Q-CTRL
ta_in: - **நிறுவனங்கள்:** Q-CTRL

source: - **Description:** Library of quantum control pulses derived from the open literature.
ta_in: - **விளக்கம்:** திறந்த இலக்கியத்திலிருந்து பெறப்பட்ட குவாண்டம் கட்டுப்பாட்டு பருப்புகளின் நூலகம்.
